app/views/families/_form.html.erb

SELECT `food_items`.* FROM `food_items` WHERE (food_items.requested >= food_items.food_promises_count) ORDER BY food_items.requested DESC
SELECT `volunteer_tasks`.* FROM `volunteer_tasks` WHERE (volunteer_tasks.requested >= volunteer_tasks.volunteer_promises_count) ORDER BY volunteer_tasks.requested DESC
---

  <%= f.input :food_items, :collection => FoodItem.where('food_items.requested > food_items.food_promises_count').order('food_items.requested DESC'), :member_label => :description, :as => :check_boxes %>
  <%= f.input :volunteer_tasks, :collection => VolunteerTask.where('volunteer_tasks.requested > volunteer_tasks.volunteer_promises_count').order('volunteer_tasks.time'), :member_label => :job_label, :as => :check_boxes %>