app/views/families/show.html.erb

<p>
<% if @family.people.size < @family.total_registrants %>It looks like you have registered more people in the accommodations section than you've told us are in your family. You might be overpaying. Please double check this. <%= link_to 'Click here to edit.', edit_family_path(@family) %> <% end %>
---
SELECT COUNT(*) FROM `people` WHERE `people`.`family_id` = 14
SELECT `people`.* FROM `people` WHERE `people`.`family_id` = 3