app/views/food_committee/show.html.erb

SELECT `families`.* FROM `families`
SELECT `food_promises`.* FROM `food_promises`
SELECT `people`.* FROM `people` WHERE `people`.`family_id` = 1
---
  <td><%= fi.requested %></td>
  <td><% fi.food_promises.each do |fp|%><% if fp.family %><%= fp.family.people[0].first_name %> <%= fp.family.people[0].last_name %><% end %><br /><% end %>