app/views/retreat_committee/show.html.erb

  <td><%= vj.requested %></td>
  <td><% vj.volunteer_promises.each do |vp|%><% if vp.family %><%= vp.family.people[0].first_name %> <%= vp.family.people[0].last_name %><% end %><br /><% end %>
---
SELECT `families`.* FROM `families`
SELECT `people`.* FROM `people` WHERE `people`.`family_id` = 5