app/controllers/families_controller.rb

SELECT `families`.* FROM `families` ORDER BY family_name
---
  def index
    flash[:notice] = "Your Transaction is #{params[:st]} for amount of $#{params[:amt]}. Thank You for shopping." if params[:st]
    @families = Family.all

SELECT `families`.* FROM `families` WHERE `families`.`id` = 1 LIMIT 1
---
  def show
    flash[:notice] = "Your Transaction is #{params[:st]} for amount of $#{params[:amt]}. Thank You for shopping." if params[:st]
    @family = Family.find(params[:id])

SELECT `families`.* FROM `families` WHERE `families`.`id` = 1 LIMIT 1
---
  def edit
    @family = Family.find(params[:id])

INSERT INTO `families` (`allergies`, `cabin`, `camp`, `contribution`, `created_at`, `day_full_weekend`, `day_partial_weekend`, `email`, `friday_snack`, `friday_supper`, `paid`, `saturday_breakfast`, `saturday_dinner`, `saturday_lunch`, `saturday_snack`, `sunday_breakfast`, `sunday_lunch`, `updated_at`) VALUES ('', 0, 0, NULL, '2013-07-30 02:00:25', 0, 0, 'nilatti@gmail.com', 0, 0, NULL, 0, 0, 0, 0, 0, 0, '2013-07-30 02:00:25')
---
  def create
    if params[:family][:contribution][0] == "$"
      params[:family][:contribution] = params[:family][:contribution].tr("$","")
    end

    @family = Family.new(params[:family])

    respond_to do |format|
      if @family.save

SELECT `families`.* FROM `families` WHERE `families`.`id` = 3 LIMIT 1
UPDATE `families` SET `cabin` = 5, `camp` = 1, `friday_supper` = 4, `friday_snack` = 6, `saturday_breakfast` = 5, `saturday_lunch` = 6, `saturday_dinner` = 6, `saturday_snack` = 6, `sunday_breakfast` = 6, `sunday_lunch` = 6, `updated_at` = '2013-01-30 02:36:08' WHERE `families`.`id` = 5
---
  def update
    if params[:family][:contribution][0] == "$"
      params[:family][:contribution] = params[:family][:contribution].tr("$","")
    end

    @family = Family.find(params[:id])

    respond_to do |format|
      if @family.update_attributes(params[:family])

SELECT `families`.* FROM `families` WHERE `families`.`id` = 1 LIMIT 1
DELETE FROM `families` WHERE `families`.`id` = 1
---
  def destroy
    @family = Family.find(params[:id])
    @family.destroy

UPDATE `families` SET paid=1 WHERE `families`.`id` IN (8, 9)
---
  def paid
    Family.update_all(["paid=?", 1], :id => params[:family_ids])