app/controllers/food_items_controller.rb

SELECT `food_items`.* FROM `food_items`
---
  def index
    @food_items = FoodItem.all

SELECT `food_items`.* FROM `food_items` WHERE `food_items`.`id` = 1 LIMIT 1
---
  def show
    @food_item = FoodItem.find(params[:id])

SELECT `food_items`.* FROM `food_items` WHERE `food_items`.`id` = 1 LIMIT 1
---
  def edit
    @food_item = FoodItem.find(params[:id])

INSERT INTO `food_items` (`created_at`, `description`, `food_promises_count`, `requested`, `updated_at`) VALUES ('2013-07-23 18:36:53', '16 oz jar of jelly', 0, 5, '2013-07-23 18:36:53')
---
  def create
    @food_item = FoodItem.new(params[:food_item])

    respond_to do |format|
      if @food_item.save