app/controllers/food_promises_controller.rb

  def index
    @food_promises = FoodPromise.all
---
SELECT `food_promises`.* FROM `food_promises`

  def show
    @food_promise = FoodPromise.find(params[:id])
---
SELECT `food_promises`.* FROM `food_promises` WHERE `food_promises`.`id` = 12 LIMIT 1

  def edit
    @food_promise = FoodPromise.find(params[:id])
---
SELECT `food_promises`.* FROM `food_promises` WHERE `food_promises`.`id` = 12 LIMIT 1

  def create
    @food_promise = FoodPromise.new(params[:food_promise])

    respond_to do |format|
      if @food_promise.save
---
INSERT INTO `food_promises` (`created_at`, `family_id`, `food_item_id`, `updated_at`) VALUES ('2013-08-19 03:33:15', 7, 2, '2013-08-19 03:33:15')

  def destroy
    @food_promise = FoodPromise.find(params[:id])
    @food_promise.destroy
---
SELECT `food_promises`.* FROM `food_promises` WHERE `food_promises`.`id` = 5 LIMIT 1
DELETE FROM `food_promises` WHERE `food_promises`.`id` = 5