app/controllers/food_committee_controller.rb

SELECT `families`.* FROM `families`
SELECT `food_items`.* FROM `food_items`
---
  def show
    @families = Family.all
    @food_items = FoodItem.all