app/controllers/registrar_controller.rb

SELECT `families`.* FROM `families`
---
  def show
    @families = Family.all

SELECT `families`.* FROM `families`
---
  def edit
  	@families = Family.all