app/controllers/retreat_committee_controller.rb

  def show
    @families = Family.all
    @volunteer_tasks = VolunteerTask.all
---
SELECT `families`.* FROM `families`
SELECT `volunteer_tasks`.* FROM `volunteer_tasks`