app/controllers/volunteer_tasks_controller.rb

SELECT `volunteer_tasks`.* FROM `volunteer_tasks`
---
  def index
    @volunteer_tasks = VolunteerTask.all

SELECT `volunteer_tasks`.* FROM `volunteer_tasks` WHERE `volunteer_tasks`.`id` = 1 LIMIT 1
---
  def show
    @volunteer_task = VolunteerTask.find(params[:id])

SELECT `volunteer_tasks`.* FROM `volunteer_tasks` WHERE `volunteer_tasks`.`id` = 1 LIMIT 1
---
  def edit
    @volunteer_task = VolunteerTask.find(params[:id])

INSERT INTO `volunteer_tasks` (`created_at`, `job_description`, `job_title`, `requested`, `time`, `updated_at`, `volunteer_promises_count`) VALUES ('2013-07-24 17:57:55', 'Make sure people are safe at the fire', 'Fire tender', 1, 'Friday -- Late night', '2013-07-24 17:57:55', NULL)
---
  def create
    @volunteer_task = VolunteerTask.new(params[:volunteer_task])

    respond_to do |format|
      if @volunteer_task.save

SELECT `volunteer_tasks`.* FROM `volunteer_tasks` WHERE `volunteer_tasks`.`id` = 1 LIMIT 1
UPDATE `volunteer_tasks` SET `job_title` = 'Chair hauler', `job_description` = 'Help put chairs in the truck and unload them at retreat', `requested` = 3, `updated_at` = '2013-07-24 17:37:12' WHERE `volunteer_tasks`.`id` = 1
---
  def update
    @volunteer_task = VolunteerTask.find(params[:id])

    respond_to do |format|
      if @volunteer_task.update_attributes(params[:volunteer_task])