app/views/food_promises/_form.html.erb

  <% f.inputs %>
  <%= f.input :family, :collection => Family.all, :member_label => :family_name %>
  <%= f.input :food_item, :collection => FoodItem.where('food_items.requested > food_items.food_promises_count'), :member_label => :description %>
---
SELECT `families`.* FROM `families`
SELECT `food_items`.* FROM `food_items` WHERE (food_items.requested > food_items.food_promises_count)